perf/perf_scripts/smarfrog.yaml

# Script generated by Blazemeter Chrome Extension

execution:
  - scenario: smartfrog
    concurrency: 2
    ramp-up: 1m
    hold-for: 3m
scenarios:
  smartfrog:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/81.0.4044.129 Safari/537.36'
      Content-Type: application/x-www-form-urlencoded
      Accept: '*/*'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=389505.215566&mode=1'
            method: POST
            label: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=389505.215566&mode=1'
            headers: {}
            body:
              q: >-
                <a i=0>See what </a><a i=1>your pet is doing </a><a i=2>from
                anywhere

                </a>
          - url: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=330622.241905&mode=1'
            method: POST
            label: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=330622.241905&mode=1'
            headers: {}
            body:
              q: >-
                <a i=0>See </a><a i=1>if your child is fine </a><a i=2>around the
                clock

                </a>
          - url: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=652476.1003315&mode=1'
            method: POST
            label: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=652476.1003315&mode=1'
            headers: {}
            body:
              q: |-
                <a i=0>Always see if
                 </a><a i=1>your grandparents are doing well</a>
      - transaction: login
        force-parent-sample: false
        do:
          - url: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=328662.243801&mode=1'
            method: POST
            label: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=328662.243801&mode=1'
            headers: {}
            body:
              q: |-
                <a i=0>Protect your family
                 </a><a i=1>easily with Smartfrog</a>
          - url: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=328662.243801&mode=1'
            method: POST
            label: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=328662.243801&mode=1'
            headers: {}
            body:
              q: |-
                <a i=0>Protect your family
                 </a><a i=1>easily with Smartfrog</a>
          - url: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=469685.102714&mode=1'
            method: POST
            label: 'https://translate.googleapis.com/translate_a/t?anno=3&client=te_lib&format=html&v=1.0&key=AIzaSyBOti4mM-6x9WDnZIjIeyEU21OpBXqWBgw&logld=vTE_20200210_00&sl=de&tl=en&sp=nmt&tc=1&dom=1&sr=1&tk=469685.102714&mode=1'
            headers: {}
            body:
              q: >-
                <a i=0>See what&#39;s happening </a><a i=1>at home </a><a
                i=2>from anywhere

                </a>
reporting:
- module: passfail
  criteria:
  - avg-rt of IndexPage>150ms for 10s, stop as failed
  - fail of CheckoutPage>50% for 10s, stop as failed
- module: final-stats
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  summary-labels: false # provides list of sample labels, status, percentage of completed, avg time and errors
  failed-labels: false  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: filename to export data in XML format
  dump-csv: filename to export data in CSV format